use clap::Args;

#[derive(Args, Debug)]
#[command(version)]
pub struct Philia093Args {}

pub fn main(_: Philia093Args, count: &u8) -> Result<(), Box<dyn std::error::Error>> {
    let message = match count {
        0 => "一如初见♪",
        1 => "「无我,即无世界。去思,去见,去征服。」",
        2 => "「世事如沧海,潮起潮落,一切终会在浪中消逝。所以,请在生命的每一刻都纵情高歌吧。」",
        3 => "「去杀死玩耍,游戏便会诞生。去杀死纷争,荣光必然降临。」",
        4 => "「若心灵仍有余裕,请稍许分出些温柔,轻抚身边美好的一切吧。」",
        5 => {
            "「『真理是溶解世界万物的溶剂,因而绝无法在客观上存在』——对此,本人心中已有绝妙的证明,但鉴于故事已临近尾声,故不再展开。」"
        }
        6 => "「信任与无私,是世上最美丽的两件华服：一件赠予他人,一件装扮自己。」",
        7 => "「多望望天,多笑一笑；好多缠人的病痛,最怕乐观这剂良药！」",
        8 => "「别怕摔,跑起来！命运就是只迟缓的若虫,它压根抓不住你！」",
        9 => "「不论晴天还是雨天,进入梦乡以前,记得和自己说一声：『明天见』！」",
        10 => "「每个人的心中都住着一个英雄。拥抱它,然后去追逐太阳吧。」",
        11 => "「笔终会折断,墨终会耗尽,生命终会逝去,但思想将在史诗中永垂不朽。」",
        12 => "「如果岁月是个无穷的轮回——那就忘掉不断重复的苦涩,单独记住每个快乐的瞬间吧！」",
        _ => "明天见！",
    };

    println!("{}", message);
    Ok(())
}
